# Clear Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
EdgeArrayArray..::..Clear Method
EdgeArrayArray Class See Also
---
Removes every edge array from the array, rendering it empty.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual void Clear()
```

Visual Basic
---
```text
Public Overridable Sub Clear
```

Visual C++
---
```text
public:
virtual void Clear()
```

# See Also
EdgeArrayArray Class
Autodesk.Revit.DB Namespace